import type { BaseLogoProps } from './types';

/**
 * 🔗 ProfileLogo (프로필 로고)
 *
 * - 이 로고는 (프로필 사진이 없는)사용자 프로필을 나타냅니다.
 * - 로고의 크기는 `size` 속성을 통해 지정할 수 있으며, 기본값은 410px입니다.
 * - 로고는 원형 배경에 흰색 아이콘으로 구성되어 있습니다.
 *
 * @component
 * @param {number} [size=410] - 로고의 가로/세로 크기 (기본값: 410)
 * @param {React.SVGProps<SVGSVGElement>} ...rest - 기타 SVG 속성 (예: className, aria-label 등)
 *
 * @example
 * // 기본 사용 (410px 크기)
 * <ProfileLogo />
 *
 * @example
 * // 크기 변경
 * <ProfileLogo size={60} />
 */

export default function ProfileLogo({ size = 410, ...rest }: BaseLogoProps) {
  return (
    <svg fill='none' height={size} viewBox='0 0 410 410' {...rest} width={size} xmlns='http://www.w3.org/2000/svg'>
      <circle cx='205' cy='205' fill='#DDF5FF' r='205' />
      <mask
        height='226'
        id='mask0_581_14431'
        maskUnits='userSpaceOnUse'
        style={{ maskType: 'alpha' }}
        width='226'
        x='91'
        y='92'
      >
        <circle
          cx='112.572'
          cy='112.572'
          fill='#89D3E3'
          r='108.269'
          stroke='#6E6E6E'
          strokeWidth='8.60706'
          transform='matrix(-1 0 0 1 317 92)'
        />
      </mask>
      <g mask='url(#mask0_581_14431)'>
        <circle cx='112.572' cy='112.572' fill='#7EDAFF' r='112.572' transform='matrix(-1 0 0 1 317 92)' />
        <path
          clipRule='evenodd'
          d='M290.217 198.392C299.983 194.201 303.408 181.367 304.634 167.905C305.988 153.031 307.768 135.405 297.337 120.188C287.121 105.284 271.71 104.981 258.233 100.213C247.341 96.3594 236.577 92.2981 227.851 95.6058C217.88 99.385 206.326 104.889 207.439 119.465C208.53 133.743 231.184 142.279 240.657 155.561C248.324 166.31 246.902 181.865 256.67 188.49C268.259 196.351 281.039 202.331 290.217 198.392Z'
          fill='#C4F78D'
          fillRule='evenodd'
        />
        <path
          clipRule='evenodd'
          d='M122.923 126.093C117.345 119.365 108.703 118.003 100.314 115.389C89.0969 111.895 77.6009 102.787 67.4234 108.803C56.285 115.386 51.6533 130.269 53.7929 142.886C55.715 154.221 67.0137 160.364 77.1091 165.92C85.3168 170.437 94.2351 171.631 103.574 170.282C115.41 168.573 130.464 168.445 135.245 157.526C140.029 146.6 130.482 135.211 122.923 126.093Z'
          fill='#C4F78D'
          fillRule='evenodd'
        />
        <path
          clipRule='evenodd'
          d='M282.068 227.169C272.852 227.686 266.017 234.844 258.321 240.888C248.03 248.968 232.944 253.372 231.153 267.147C229.193 282.222 238.355 297.01 250.134 303.852C260.717 309.998 273.237 303.7 284.479 298.119C293.619 293.581 300.499 286.045 305.569 276.331C311.995 264.021 321.848 249.797 316.041 237.649C310.23 225.493 294.559 226.468 282.068 227.169Z'
          fill='#C4F78D'
          fillRule='evenodd'
        />
        <path
          clipRule='evenodd'
          d='M178.145 292.638C188.559 285.41 194.173 271.534 191.658 259.17C189.493 248.525 175.529 247.133 167.421 239.918C158.475 231.957 155.109 215.506 143.097 215.955C130.579 216.423 122.804 230.062 118.297 241.756C114.356 251.985 116.353 263.012 121.192 272.799C125.827 282.171 133.565 289.185 143.453 292.629C154.921 296.624 168.129 299.591 178.145 292.638Z'
          fill='#C4F78D'
          fillRule='evenodd'
        />
      </g>
      <path
        d='M196.726 202.766C182.627 210.537 169.141 211.044 154.123 202.766'
        stroke='#006FED'
        strokeLinecap='round'
        strokeWidth='8.60706'
      />
      <rect fill='#006FED' height='15.6517' rx='7.10039' transform='matrix(-1 0 0 1 203.827 167.851)' width='14.2008' />
      <rect fill='#006FED' height='15.6517' rx='7.10039' transform='matrix(-1 0 0 1 162.644 167.851)' width='14.2008' />
    </svg>
  );
}

ProfileLogo.displayName = 'ProfileLogo';
