import type { ColorIconProps } from './types';

/**
 * 🔔 BellIcon (벨 아이콘)
 *
 * - 이 아이콘은 알림을 나타내는 벨 모양의 아이콘이고, 기본적으로 검정색(#1F1F22)으로 렌더링됩니다.
 * - 색상은 `color` 속성을 통해 지정할 수 있으며, 기본적으로 검정색으로 렌더링됩니다.
 * - 아이콘의 크기는 CSS 클래스(`size-20`, `size-24` 등)를 통해 조정할 수 있습니다.
 *
 * @component
 * @param {string} [color='black'] - 아이콘의 색상 (기본값: 'black')
 * @param {React.SVGProps<SVGSVGElement>} ...rest - 기타 SVG 속성 (예: className, aria-label 등)
 *
 * @example
 * // 기본 사용 (16px 크기)
 * <BellIcon />
 *
 * @example
 * // 크기 변경
 * <BellIcon className='size-32' />
 *
 * @example
 * // 색상 변경
 * <BellIcon color='var(--color-red)' />
 */

export default function BellIcon({ color = '#1F1F22', ...rest }: ColorIconProps) {
  return (
    <svg fill='none' height='19' viewBox='0 0 16 19' width='16' {...rest} xmlns='http://www.w3.org/2000/svg'>
      <path
        d='M9.49085 1.55818C9.49085 2.41873 8.79323 3.11635 7.93267 3.11635C7.07211 3.11635 6.3745 2.41873 6.3745 1.55818C6.3745 0.697619 7.07211 0 7.93267 0C8.79323 0 9.49085 0.697619 9.49085 1.55818Z'
        fill={color}
      />
      <path
        d='M7.93431 1.55815C11.0565 1.5584 13.6003 4.03007 13.7174 7.12362C13.7175 7.12522 13.7188 7.12651 13.7204 7.12651C13.722 7.12651 13.7234 7.12784 13.7234 7.12949V10.5056C13.7234 11.125 14.4413 11.6196 14.7888 12.1324L15.8005 13.6265C16.2498 14.2905 15.774 15.1868 14.9724 15.1871H1.00169C0.199813 15.1871 -0.27591 14.2906 0.173567 13.6265L1.18431 12.1324C1.51407 11.6456 2.14622 11.1794 2.14622 10.5914V7.12949C2.14622 7.12784 2.14756 7.12651 2.14921 7.12651C2.15081 7.12651 2.15213 7.12522 2.15219 7.12362C2.2693 4.03006 4.81215 1.55837 7.93431 1.55815Z'
        fill={color}
      />
      <path
        d='M10.3384 16.4513C10.3382 17.7834 9.25833 18.8635 7.92625 18.8635C6.67737 18.8633 5.65024 17.9138 5.52684 16.6974L5.51414 16.4513H10.3384Z'
        fill={color}
      />
    </svg>
  );
}

BellIcon.displayName = 'BellIcon';
