import type { ColorIconProps } from './types';

/**
 * 🍔 FoodIcon (라면 아이콘)
 *
 * - 이 아이콘은 식음료 라벨에 사용됩니다.
 * - 색상은 `color` 속성을 통해 지정할 수 있으며, 기본적으로 검정색으로 렌더링됩니다.
 * - 아이콘의 크기는 CSS 클래스(`size-20`, `size-24` 등)를 통해 조정할 수 있습니다.
 *
 * @component
 * @param {string} [color='black'] - 아이콘의 색상 (기본값: 'black')
 * @param {React.SVGProps<SVGSVGElement>} ...rest - 기타 SVG 속성 (예: className, aria-label 등)
 *
 * @example
 * // 기본 사용 (20px 크기)
 * <FoodIcon />
 *
 * @example
 * // 크기 변경
 * <FoodIcon className='size-32' />
 *
 * @example
 * // 색상 변경
 * <FoodIcon color='var(--color-red)' />
 */

export default function FoodIcon({ color = 'black', ...rest }: ColorIconProps) {
  return (
    <svg fill='none' height='20' viewBox='0 0 20 20' width='20' {...rest} xmlns='http://www.w3.org/2000/svg'>
      <path
        d='M19 8H1C0.734784 8 0.48043 8.10536 0.292893 8.29289C0.105357 8.48043 0 8.73478 0 9C4.45922e-05 10.7553 0.462128 12.4797 1.33981 13.9999C2.21749 15.52 3.47985 16.7823 5 17.66V19C5 19.2652 5.10536 19.5196 5.29289 19.7071C5.48043 19.8946 5.73478 20 6 20H14C14.2652 20 14.5196 19.8946 14.7071 19.7071C14.8946 19.5196 15 19.2652 15 19V17.66C16.5202 16.7823 17.7825 15.52 18.6602 13.9999C19.5379 12.4797 20 10.7553 20 9C20 8.73478 19.8946 8.48043 19.7071 8.29289C19.5196 8.10536 19.2652 8 19 8ZM7 7V5.93C7.00063 4.75322 6.54129 3.6228 5.72 2.78C5.48815 2.54572 5.30512 2.26775 5.18152 1.96219C5.05793 1.65664 4.99623 1.32958 5 1V0H3V1C2.99413 2.1837 3.45386 3.32226 4.28 4.17C4.74339 4.63831 5.00229 5.27118 5 5.93V7H7ZM11 7V5.93C11.0006 4.75322 10.5413 3.6228 9.72 2.78C9.48815 2.54572 9.30512 2.26775 9.18152 1.96219C9.05793 1.65664 8.99623 1.32958 9 1V0H7V1C6.99937 2.17678 7.45871 3.30721 8.28 4.15C8.51185 4.38428 8.69488 4.66225 8.81848 4.96781C8.94207 5.27336 9.00377 5.60042 9 5.93V7H11ZM15 7V5.93C15.0006 4.75322 14.5413 3.6228 13.72 2.78C13.4882 2.54572 13.3051 2.26775 13.1815 1.96219C13.0579 1.65664 12.9962 1.32958 13 1V0H11V1C10.9994 2.17678 11.4587 3.30721 12.28 4.15C12.5118 4.38428 12.6949 4.66225 12.8185 4.96781C12.9421 5.27336 13.0038 5.60042 13 5.93V7H15Z'
        fill={color}
      />
    </svg>
  );
}

FoodIcon.displayName = 'FoodIcon';
