import type { ColorIconProps } from './types';

/**
 * 🏉 SportIcon (럭비 아이콘)
 *
 * - 이 아이콘은 스포츠 라벨에 사용됩니다.
 * - 색상은 `color` 속성을 통해 지정할 수 있으며, 기본적으로 검정색으로 렌더링됩니다.
 * - 아이콘의 크기는 CSS 클래스(`size-20`, `size-24` 등)를 통해 조정할 수 있습니다.
 *
 * @component
 * @param {string} [color='black'] - 아이콘의 색상 (기본값: 'black')
 * @param {React.SVGProps<SVGSVGElement>} ...rest - 기타 SVG 속성 (예: className, aria-label 등)
 *
 * @example
 * // 기본 사용 (21px 크기)
 * <SportIcon />
 *
 * @example
 * // 크기 변경
 * <SportIcon className='size-32' />
 *
 * @example
 * // 색상 변경
 * <SportIcon color='var(--color-red)' />
 */

export default function SportIcon({ color = 'black', ...rest }: ColorIconProps) {
  return (
    <svg fill='none' height='20' viewBox='0 0 20 20' width='20' {...rest} xmlns='http://www.w3.org/2000/svg'>
      <path
        d='M18.2464 1.03456C18.1774 1.01656 16.5044 0.601562 14.1944 0.601562C11.3524 0.601562 7.32643 1.24156 4.28443 4.28856C-1.05557 9.63756 0.944426 17.8986 1.03243 18.2486C1.07667 18.4241 1.16776 18.5844 1.29598 18.7123C1.42419 18.8401 1.58472 18.9308 1.76043 18.9746C1.82943 18.9926 3.48643 19.4006 5.77843 19.4006C8.62743 19.4006 12.6624 18.7596 15.7104 15.7126C21.0454 10.3776 19.0614 2.11256 18.9744 1.76356C18.9302 1.58766 18.8391 1.42703 18.7109 1.29868C18.5828 1.17034 18.4223 1.07907 18.2464 1.03456ZM14.7094 10.2966L13.2954 11.7106L11.5024 9.91856L9.91643 11.5046L11.7084 13.2976L10.2944 14.7116L8.50243 12.9186L6.70943 14.7116L5.29543 13.2976L7.08843 11.5046L5.29543 9.71056L6.70943 8.29656L8.50243 10.0906L10.0884 8.50456L8.29443 6.71156L9.70843 5.29756L11.5024 7.09056L13.2954 5.29756L14.7094 6.71156L12.9164 8.50456L14.7094 10.2966Z'
        fill={color}
      />
    </svg>
  );
}

SportIcon.displayName = 'SportIcon';
