import type { ColorIconProps } from './types';

/**
 * 🌱 WellbeingIcon (새싹 아이콘)
 *
 * - 이 아이콘은 웰빙 라벨에 사용됩니다.
 * - 색상은 `color` 속성을 통해 지정할 수 있으며, 기본적으로 검정색으로 렌더링됩니다.
 * - 아이콘의 크기는 CSS 클래스(`size-20`, `size-24` 등)를 통해 조정할 수 있습니다.
 *
 * @component
 * @param {string} [color='black'] - 아이콘의 색상 (기본값: 'black')
 * @param {React.SVGProps<SVGSVGElement>} ...rest - 기타 SVG 속성 (예: className, aria-label 등)
 *
 * @example
 * // 기본 사용 (20px 크기)
 * <WellbeingIcon />
 *
 * @example
 * // 크기 변경
 * <WellbeingIcon className='size-32' />
 *
 * @example
 * // 색상 변경
 * <WellbeingIcon color='var(--color-red)' />
 */

export default function WellbeingIcon({ color = 'black', ...rest }: ColorIconProps) {
  return (
    <svg fill='none' height='20' viewBox='0 0 20 20' width='20' {...rest} xmlns='http://www.w3.org/2000/svg'>
      <path
        d='M18.9988 1.40844L18.8788 0.148438L17.6788 0.548437C15.6223 1.26298 13.4261 1.48225 11.2688 1.18844C9.00199 0.836649 6.68176 1.14925 4.58884 2.08844C3.47932 2.56088 2.50559 3.30335 1.75631 4.24825C1.00704 5.19314 0.506006 6.31045 0.29884 7.49844C0.0302186 9.03313 0.164602 10.6113 0.68884 12.0784C1.02639 11.3165 1.42084 10.5811 1.86884 9.87844C2.88504 8.38328 4.29312 7.19662 5.93884 6.44844C7.52428 5.72456 9.25723 5.38208 10.9988 5.44844C9.34086 5.70194 7.75384 6.29792 6.33884 7.19844C5.65631 7.62729 5.03127 8.14143 4.47884 8.72844C3.9505 9.31516 3.48466 9.95528 3.08884 10.6384C2.34537 12.0664 1.81635 13.5962 1.51884 15.1784C1.19815 16.7658 1.02409 18.3792 0.99884 19.9984H2.99884C3.09284 18.5463 3.29 17.1026 3.58884 15.6784C4.97627 16.4276 6.53219 16.8097 8.10884 16.7884C9.57932 16.7874 11.0347 16.4916 12.3888 15.9184C19.9988 12.6684 18.9988 1.85844 18.9988 1.40844Z'
        fill={color}
      />
    </svg>
  );
}

WellbeingIcon.displayName = 'WellbeingIcon';
